app/Controllers/Auth.php

SELECT *
FROM `tabel_user`
JOIN `user_details` ON `user_details`.`email`=`tabel_user`.`email`
WHERE `tabel_user`.`email` = 'admin@gmail.com'
 LIMIT 1
---
        }

        $data = $this->request->getPost();
        $auth = $this->userModel->where('tabel_user.email', $data['email'])
            ->join('user_details', 'user_details.email=tabel_user.email')
            ->first();